# MICROSOFT MOVIE STUDIO

# Business Understanding
## Business Problem
Microsoft sees all the big companies creating original video content and they want to get in on the fun. They have decided to create a new movie studio, but they don’t know anything about creating movies. You are charged with exploring what types of films are currently doing the best at the box office. You must then translate those findings into actionable insights that the head of Microsoft's new movie studio can use to help decide what type of films to create.

## Problem Statement

## Main Objective

## Specific Objecive

## Experimental Design


## Data Understanding
The data we are working with has come from
- (https://www.boxofficemojo.com/)
- (https://www.imdb.com/)
- (https://www.rottentomatoes.com/)
- (https://www.themoviedb.org/)
- (https://www.the-numbers.com/)

# Importing The Libraries

In [1]:
# importing necessary libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

# Reading The Data

In [4]:
# loading the data from bom.movie_gross csv file
bom = pd.read_csv("bom.movie_gross.csv")
bom.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [6]:
# loading the data from the title.basics csv file
movie_basics = pd.read_csv("title.basics.csv")
movie_basics.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [24]:
# loading the data from the title.ratings csv file
movie_ratings = pd.read_csv("title.ratings.csv")
movie_ratings.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [8]:
movie_ratings.describe()

       averagerating      numvotes
count   73856.000000  7.385600e+04
mean        6.332729  3.523662e+03
std         1.474978  3.029402e+04
min         1.000000  5.000000e+00
25%         5.500000  1.400000e+01
50%         6.500000  4.900000e+01
75%         7.400000  2.820000e+02
max        10.000000  1.841066e+06

In [9]:
movie_ratings.shape

(73856, 3)

In [10]:
budget = pd.read_csv("tn.movie_budgets.csv")
budget.head(10)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000","$936,662,225","$2,053,311,220"
6,7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200"
7,8,"May 24, 2007",Pirates of the Caribbean: At Worldâs End,"$300,000,000","$309,420,425","$963,420,425"
8,9,"Nov 17, 2017",Justice League,"$300,000,000","$229,024,295","$655,945,209"
9,10,"Nov 6, 2015",Spectre,"$300,000,000","$200,074,175","$879,620,923"

In [11]:
budget.shape

(5782, 6)

In [13]:
# check for duplicate entries in the budget table
budget.duplicated().sum()

0

In [14]:
# check for missing values in the budget table
budget.isnull().sum()

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

In [18]:
# selecting the domestic_gross and worldwide_gross columns
budget = budget[['domestic_gross', 'worldwide_gross']]
budget.head()

  domestic_gross worldwide_gross
0   $760,507,625  $2,776,345,279
1   $241,063,875  $1,045,663,875
2    $42,762,350    $149,762,350
3   $459,005,868  $1,403,013,963
4   $620,181,382  $1,316,721,747

In [23]:
# changing the data type of domestic_gross and worldwide_gross columns
budget.domestic_gross.str.replace('$', '')
budget.worldwide_gross.str.replace('$', '')
budget.head()

  domestic_gross worldwide_gross                 total_gross
0   $760,507,625  $2,776,345,279  $760,507,625$2,776,345,279
1   $241,063,875  $1,045,663,875  $241,063,875$1,045,663,875
2    $42,762,350    $149,762,350     $42,762,350$149,762,350
3   $459,005,868  $1,403,013,963  $459,005,868$1,403,013,963
4   $620,181,382  $1,316,721,747  $620,181,382$1,316,721,747

Exploratory Data Analysis

In [27]:
movie_ratings.averagerating.astype(int)

0        8
1        8
2        6
3        4
4        6
        ..
73851    8
73852    7
73853    4
73854    7
73855    6
Name: averagerating, Length: 73856, dtype: int32